rebuild from last karpenter failure
